# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Development
brew 'imagemagick'
brew 'yarn'
brew 'nvm'
brew 'pnpm'
brew 'azure-cli'

# Apps
cask '1password'
cask 'raycast'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'arc'
cask 'github'
cask 'herd'
cask 'google-chrome'
cask 'postman'
cask 'slack'
cask 'visual-studio-code'
cask 'the-unarchiver'
cask 'zoom'
cask 'dbngin'
cask 'warp'
cask 'linear-linear'
cask 'kindle'
cask 'todoist'
cask 'setapp'
cask 'jetbrains-toolbox'
cask 'microsoft-edge'
cask 'dotnet'
cask 'azure-data-studio'
cask 'powershell'
cask 'chatgpt'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-cascadia-mono'
cask 'font-cascadia-mono-pl'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'TestFlight', id: 899247664
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'WhatsApp Messenger', id: 310633997
mas 'GoodLinks', id: 1474335294
mas 'Trello', id: 1278508951
