#######################
# Taps
#######################
tap "homebrew/cask"
tap "homebrew/cask-fonts"

#######################
# Core CLI & DX
#######################
brew "git"            # version control
brew "gh"             # GitHub CLI (PRs, issues, releases)
brew "git-delta"      # prettier git diffs
brew "lazygit"        # fast TUI for Git (stage/rebase/conflicts)

brew "ripgrep"        # ultra-fast code search (rg)
brew "fd"             # modern, fast `find` replacement
brew "fzf"            # fuzzy finder (files/history)
brew "bat"            # `cat` with syntax highlight + line numbers
brew "eza"            # modern `ls` (colors/columns)
brew "zoxide"         # smart `cd`
brew "jq"             # JSON in CLI
brew "yq"             # YAML in CLI

brew "mise"           # one runtime manager (node/python/etc.)
brew "direnv"         # per-project environment variables
brew "pre-commit"     # lightweight quality gates per repo
brew "tldr"           # command cheatsheets
brew "just"           # command runner for tasks

# --- Optional GNU utils (enable only if you need them) ---
# brew "coreutils"
# brew "gnu-sed"
# brew "findutils"
# brew "openssl@3"
# brew "pkg-config"    # (OPTIONAL) needed when compiling some native libs
# brew "httpie"        # (OPTIONAL) nicer UX than curl for APIs

#######################
# Databases / SQL
#######################
brew "pgcli"          # Postgres CLI with autocomplete
brew "mycli"          # MySQL/MariaDB CLI with autocomplete
brew "sqlite-utils"   # handy SQLite utilities from CLI

#######################
# .NET (SDK/runtime)
#######################
cask "dotnet-sdk"           # .NET SDK + runtime for building/running .NET apps
cask "azure-data-studio"    # SQL & data tooling for MS stack
# cask "powershell"         # (OPTIONAL) PowerShell if you use it regularly
brew "azure-cli"            # Azure CLI (common with .NET backends)

#######################
# DevOps / Containers (lightweight)
#######################
brew "colima"         # lightweight VM for Docker on Apple Silicon
brew "docker"         # Docker CLI
brew "hey"            # quick HTTP micro load testing

# --- Enable only if you actually need them on this machine ---
# brew "kubectl"
# brew "k9s"
# brew "helm"
# brew "stern"
# brew "terraform"
# brew "terragrunt"
# brew "awscli"
# brew "google-cloud-sdk"

# Development
brew 'imagemagick'
brew 'azure-cli'

#######################
# Apps (casks)
#######################
# Editors
cask "visual-studio-code"
cask "cursor"                 # AI-first alternative (enable if you use it)
cask "jetbrains-toolbox"      # optional (PHPStorm/WebStorm when needed)

# DB & APIs
cask "dbngin"
cask "postman"

# Security & productivity
cask "1password"
cask "1password-cli"
cask "raycast"
cask "rectangle"
cask "monitorcontrol"
cask "the-unarchiver"   # quick extract for many archive formats
cask "todoist-app"    # Todoist desktop app

# Browsers
cask "google-chrome"

# Terminal
cask "warp"

# Team & collaboration
cask "slack"
cask "discord"
cask "linear-linear"
cask "zoom"
cask "github"           # GitHub Desktop

# Design
cask "figma"

# Dev convenience
cask "herd"             # Laravel Herd (fast local PHP stack)
cask "setapp"           # Setapp subscription manager
cask "chatgpt"          # ChatGPT desktop app by OpenAI

#######################
# Fonts (optional)
#######################
cask "font-jetbrains-mono"
cask "font-fira-code"

#######################
# Mac App Store (optional)
#######################
brew "mas"
mas "Amphetamine", id: 937984704
mas "TestFlight",  id: 899247664
mas "WhatsApp",    id: 310633997
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'GoodLinks', id: 1474335294
mas 'Trello', id: 1278508951
